app/Http/Controllers/users/Usercontroller.php

    public function bookings()
    {
        $bookings= Booking::where('user_id',Auth::user()->id)->get();
---
select * from `bookings` where `user_id` = 2